/**
 * Created by Илья on 08.03.2016.
 */
'use strict'
function Shar(bot, msg, suffix) {
    if (suffix.length === 0) {
        msg.channel.sendMessage(msg.author + " Мм? Че такое?\n");
        msg.channel.sendFile("./images/shar.jpg")
    } else {
        var rand = Math.floor(Math.random() * EightBall.length);
        msg.channel.sendMessage(msg.author + ":crystal_ball:**" + EightBall[rand] + "**:crystal_ball:");
    }
}

var EightBall = [
    "Это точно",
    "Без сомнения",
    "Да, безусловно",
    "Как я вижу, да",
    "Скорее всего",
    "А ты как думаешь сам?",
    "Конечно, конечно",
    "Звезды Далекой Галактики указывают на да",
    "Вы не сможете принять правду",
    "Вполне вероятно",
    "Лучше не говорить вам сейчас",
    "Не могу... Очень тяжело, надо спросить Кайла..",
    "Не рассчитывайте на это",
    "Кайл говорит нет",
    "Кайл говорит да",
    "В твоих мечтах",
    "Вы обречены",
    "Очень сомнительно",
    "Да кто его знает, пойди в джа лучше поиграй",
    "Воу, вероятность мала, возможно да, возможно нет"
];

/*===============================================================================*/
/*===============================================================================*/
/*===============================================================================*/
module.exports = Shar;